#
# Part IV. Pull Request (PR)
#

#
# 在这一部分，我们提交 PR。
#
# 0. 你应该以 root 用户登录宿主系统，如：
#    ssh root@192.168.56.102 # instead of your own IP address
# 1. 将作业以 PR 的形式提交。
#

whoami # root

cd # /root

cat > ~/tf/part-4.txt << "EOF"
        __        __   _
        \ \      / /__| | ___ ___  _ __ ___   ___
         \ \ /\ / / _ \ |/ __/ _ \| '_ ` _ \ / _ \
          \ V  V /  __/ | (_| (_) | | | | | |  __/
           \_/\_/ \___|_|\___\___/|_| |_| |_|\___|

                           _
                          | |_ ___
                          | __/ _ \
                          | || (_) |
                           \__\___/

             ____            _       ___ __     __
            |  _ \ __ _ _ __| |_    |_ _|\ \   / /
            | |_) / _` | '__| __|    | |  \ \ / /
            |  __/ (_| | |  | |_     | |   \ V /
            |_|   \__,_|_|   \__|   |___|   \_/

EOF

cat ~/tf/part-4.txt 1>&2

#
# 请按照《实验手册》指导提交 PR，此处从略。
#








